export type SearchName =
  | '내위치'
  | '전체'
  | '서울'
  | '부산'
  | '대구'
  | '인천'
  | '광주'
  | '대전'
  | '울산'
  | '세종'
  | '경기도'
  | '강원도'
  | '충청도'
  | '전라도'
  | '경상도'
  | '제주도';
export type SearchSubName =
  | '내위치'
  | Seoul
  | Daegu
  | Incheon
  | Gwangju
  | Daejeon
  | Ulsan
  | Sejong
  | GyeonggiDo
  | GangwonDo
  | ChungcheongDo
  | JeollaDo
  | GyeongsangDo
  | JeJuDo;

type Seoul =
  | '전체'
  | '종로구'
  | '중구'
  | '용산구'
  | '성동구'
  | '광진구'
  | '동대문'
  | '중랑구'
  | '성북구'
  | '강북구'
  | '도봉구'
  | '노원구'
  | '은평구'
  | '서대문'
  | '마포구'
  | '양천구'
  | '강서구'
  | '구로구'
  | '금천구'
  | '영등포'
  | '동작구'
  | '관악구'
  | '서초구'
  | '강남구'
  | '송파구'
  | '강동구';

type Busan =
  | '전체'
  | '중구'
  | '서구'
  | '동구'
  | '영도구'
  | '부산진'
  | '동래구'
  | '남구'
  | '북구'
  | '강서구'
  | '해운대'
  | '사하구'
  | '금정구'
  | '연제구'
  | '수영구'
  | '사상구';
type Daegu = '전체' | '중구' | '동구' | '서구' | '남구' | '북구' | '수성구' | '달서구' | '달성군';
type Incheon =
  | '전체'
  | '중구'
  | '동구'
  | '미추홀'
  | '연수구'
  | '남동구'
  | '부평구'
  | '계양구'
  | '서구'
  | '강화군'
  | '옹진군';
type Gwangju = '전체' | '동구' | '서구' | '남구' | '북구' | '광산구';
type Daejeon = '전체' | '동구' | '중구' | '서구' | '유성구' | '대덕구';
type Ulsan = '전체' | '중구' | '남구' | '동구' | '북구' | '울주군';
type Sejong = '전체' | '세종';
type GyeonggiDo =
  | '전체'
  | '수원'
  | '안양'
  | '안산'
  | '용인'
  | '부천'
  | '광명'
  | '평택'
  | '과천'
  | '오산'
  | '시흥'
  | '군포'
  | '의왕'
  | '하남'
  | '이천'
  | '안성'
  | '김포'
  | '화성'
  | '광주'
  | '여주'
  | '양평'
  | '고양'
  | '의정부'
  | '동두천'
  | '구리'
  | '남양주'
  | '파주'
  | '양주'
  | '포천'
  | '연천'
  | '가평';
type GangwonDo =
  | '전체'
  | '춘천'
  | '원주'
  | '강릉'
  | '동해'
  | '태백'
  | '속초'
  | '삼척'
  | '홍천'
  | '횡성'
  | '영월'
  | '평창'
  | '정선'
  | '철원'
  | '화천'
  | '양구'
  | '인제'
  | '고성'
  | '양양';
type ChungcheongDo =
  | '전체'
  | '청주'
  | '충주'
  | '제천'
  | '보은'
  | '옥천'
  | '영동'
  | '증평'
  | '진천'
  | '괴산'
  | '음성'
  | '단양'
  | '천안'
  | '공주'
  | '보령'
  | '아산'
  | '서산'
  | '논산'
  | '계룡'
  | '당진'
  | '금산'
  | '부여'
  | '서천'
  | '청양'
  | '홍성'
  | '예산'
  | '태안';
type JeollaDo =
  | '전체'
  | '전주'
  | '군산'
  | '익산'
  | '정읍'
  | '남원'
  | '김제'
  | '완주'
  | '진안'
  | '무주'
  | '장수'
  | '임실'
  | '순창'
  | '고창'
  | '부안'
  | '목포'
  | '여수'
  | '순천'
  | '나주'
  | '광양'
  | '담양'
  | '곡성'
  | '구례'
  | '고흥'
  | '보성'
  | '화순'
  | '장흥'
  | '강진'
  | '해남'
  | '영암'
  | '무안'
  | '함평'
  | '영광'
  | '장성'
  | '완도'
  | '진도'
  | '신안';
type GyeongsangDo =
  | '전체'
  | '포항'
  | '경주'
  | '김천'
  | '안동'
  | '구미'
  | '영주'
  | '영천'
  | '상주'
  | '문경'
  | '경산'
  | '군위'
  | '의성'
  | '청송'
  | '영양'
  | '영덕'
  | '청도'
  | '고령'
  | '성주'
  | '칠곡'
  | '예천'
  | '봉화'
  | '울진'
  | '울릉'
  | '창원'
  | '진주'
  | '통영'
  | '사천'
  | '김해'
  | '밀양'
  | '거제'
  | '양산'
  | '의령'
  | '함안'
  | '창녕'
  | '고성'
  | '남해'
  | '하동'
  | '산청'
  | '함양'
  | '거창'
  | '합천';
type JeJuDo = '제주' | '서귀포' | '전체';

export const administrativeDistrictName: SearchName[] = [
  '내위치',
  '전체',
  '서울',
  '부산',
  '대구',
  '인천',
  '광주',
  '대전',
  '울산',
  '세종',
  '경기도',
  '강원도',
  '충청도',
  '전라도',
  '경상도',
  '제주도',
];

export type SubName =
  | '전체'[]
  | Seoul[]
  | Busan[]
  | Daegu[]
  | Incheon[]
  | Gwangju[]
  | Daejeon[]
  | Ulsan[]
  | Sejong[]
  | GyeonggiDo[]
  | GangwonDo[]
  | ChungcheongDo[]
  | JeollaDo[]
  | GyeongsangDo[]
  | JeJuDo[];
export interface AdministrativeDistrict {
  내위치: '내위치'[];
  전체: '전체'[];
  서울: Seoul[];
  부산: Busan[];
  대구: Daegu[];
  인천: Incheon[];
  광주: Gwangju[];
  대전: Daejeon[];
  울산: Ulsan[];
  세종: Sejong[];
  경기도: GyeonggiDo[];
  강원도: GangwonDo[];
  충청도: ChungcheongDo[];
  전라도: JeollaDo[];
  경상도: GyeongsangDo[];
  제주도: JeJuDo[];
}

export const administrativeDistrict: AdministrativeDistrict = {
  내위치: ['내위치'],
  전체: ['전체'],
  서울: [
    '전체',
    '종로구',
    '중구',
    '용산구',
    '성동구',
    '광진구',
    '동대문',
    '중랑구',
    '성북구',
    '강북구',
    '도봉구',
    '노원구',
    '은평구',
    '서대문',
    '마포구',
    '양천구',
    '강서구',
    '구로구',
    '금천구',
    '영등포',
    '동작구',
    '관악구',
    '서초구',
    '강남구',
    '송파구',
    '강동구',
  ],
  부산: [
    '전체',
    '중구',
    '서구',
    '동구',
    '영도구',
    '부산진',
    '동래구',
    '남구',
    '북구',
    '강서구',
    '해운대',
    '사하구',
    '금정구',
    '연제구',
    '수영구',
    '사상구',
  ],
  대구: ['전체', '중구', '동구', '서구', '남구', '북구', '수성구', '달서구', '달성군'],
  인천: ['전체', '중구', '동구', '미추홀', '연수구', '남동구', '부평구', '계양구', '서구', '강화군', '옹진군'],
  광주: ['전체', '동구', '서구', '남구', '북구', '광산구'],
  대전: ['전체', '동구', '중구', '서구', '유성구', '대덕구'],
  울산: ['전체', '중구', '남구', '동구', '북구', '울주군'],
  세종: ['전체', '세종'],
  경기도: [
    '전체',
    '수원',
    '안양',
    '안산',
    '용인',
    '부천',
    '광명',
    '평택',
    '과천',
    '오산',
    '시흥',
    '군포',
    '의왕',
    '하남',
    '이천',
    '안성',
    '김포',
    '화성',
    '광주',
    '여주',
    '양평',
    '고양',
    '의정부',
    '동두천',
    '구리',
    '남양주',
    '파주',
    '양주',
    '포천',
    '연천',
    '가평',
  ],
  강원도: [
    '전체',
    '춘천',
    '원주',
    '강릉',
    '동해',
    '태백',
    '속초',
    '삼척',
    '홍천',
    '횡성',
    '영월',
    '평창',
    '정선',
    '철원',
    '화천',
    '양구',
    '인제',
    '고성',
    '양양',
  ],
  충청도: [
    '전체',
    '청주',
    '충주',
    '제천',
    '보은',
    '옥천',
    '영동',
    '증평',
    '진천',
    '괴산',
    '음성',
    '단양',
    '천안',
    '공주',
    '보령',
    '아산',
    '서산',
    '논산',
    '계룡',
    '당진',
    '금산',
    '부여',
    '서천',
    '청양',
    '홍성',
    '예산',
    '태안',
  ],
  전라도: [
    '전체',
    '전주',
    '군산',
    '익산',
    '정읍',
    '남원',
    '김제',
    '완주',
    '진안',
    '무주',
    '장수',
    '임실',
    '순창',
    '고창',
    '부안',
    '목포',
    '여수',
    '순천',
    '나주',
    '광양',
    '담양',
    '곡성',
    '구례',
    '고흥',
    '보성',
    '화순',
    '장흥',
    '강진',
    '해남',
    '영암',
    '무안',
    '함평',
    '영광',
    '장성',
    '완도',
    '진도',
    '신안',
  ],
  경상도: [
    '전체',
    '포항',
    '경주',
    '김천',
    '안동',
    '구미',
    '영주',
    '영천',
    '상주',
    '문경',
    '경산',
    '군위',
    '의성',
    '청송',
    '영양',
    '영덕',
    '청도',
    '고령',
    '성주',
    '칠곡',
    '예천',
    '봉화',
    '울진',
    '울릉',
    '창원',
    '진주',
    '통영',
    '사천',
    '김해',
    '밀양',
    '거제',
    '양산',
    '의령',
    '함안',
    '창녕',
    '고성',
    '남해',
    '하동',
    '산청',
    '함양',
    '거창',
    '합천',
  ],
  제주도: ['전체', '제주', '서귀포'],
};
